import { makeStrings } from '@monoid-dev/use-strings';

export const useOpeningStrings = makeStrings({
  'ja-JP': {
    slogan: (
      <>
        新しい時代の技術を、
        <br />
        全ての人に。
      </>
    ),
    introTitle: (
      <>
        monoidは、上海と東京の拠点からグローバルに活動するデザイン＆テクノロジー会社です。
      </>
    ),
    introDetails: (
      <>
        私たちは、最先端かつ信頼性の高い新技術によって、日々の課題を解決し、新しい未来への道を切り拓いていきます。
      </>
    ),
    technologyTitle: (
      <>
        私たちは、あなたの「テクノロジーパートナー」として、次世代へ向けた新しいものを発明します。
      </>
    ),
    technologyDetails: (
      <>
        デザイナーとエンジニアの専門チームによるクリエイティブな課題解決で、より良い世界の実現にコミットしています。
        ただ新しい技術を押しつけるのではなく、旧来の価値観や手法が新しいものに移行していく際に生じる摩擦や軋轢などのリスクも含め、お客様の技術的な意思決定を包括的にサポートします。
      </>
    ),
  },
});
